{
  "secrets": [
    {
      "condition": "Burnt journal page",
      "secret": "*examines the page carefully* I don't know what this is, sir. I don't know much about what goes on inside the manor walls. Servants hear things, of course... *hesitates* Mrs. Holloway, she likes giving orders. Always insisting on this or that. But I've never seen this handwriting before. It's not Miss Judith's, that's for sure."
    },
    {
      "condition": "Dismissal letter",
      "secret": "Martha's dismissal? That was unfair, that was. She was accused of stealing Miss Judith's jewels, but I don't believe it for a second. Martha never stole anything, sir. lowers his voice Everyone downstairs knows it. She was devoted to Miss Judith since her childhood. *hesitation* She was very worried about her lately. Martha and I would talk sometimes. She said she was afraid something bad would happen to Miss Judith, but she never told me exactly what."
    },
    {
      "condition": "Scented tea box",
      "secret": "*sniffs the box* This tea isn't what we drink downstairs, sir. It's too... elegant. *small smile* Miss Judith liked her tea. She had me taste it once, in secret. Not this one, though. This one, I believe, belongs to Mrs. Holloway. She's very particular about her habits."
    },
    {
      "condition": "Lord Blackwood's will",
      "secret": "*looks at the document with hesitation* I can't read these complicated documents, sir. Lord Blackwood's legal affairs aren't my domain. *after explanation* Ah, so he wanted to protect the inheritance for Miss Judith's children? *thoughtful expression* She never mentioned that to me. But she wasn't happy about this marriage, that I know."
    },
    {
      "condition": "Hidden message",
      "secret": "*his eyes light up, then darken* That's her handwriting. Judith... Miss Judith, I mean. *lightly touches the paper* She wanted to see me that night. She said she had important news. I replied, left a message in her room for us to meet in the attic. *broken voice* I didn't know what the news was. I never found out."
    },
    {
      "condition": "Ring with initials",
      "secret": "That belongs to Mr. Cavendish. *dark expression* He lost it when we... *stops* when he came to the stables. *straightens his shoulders* He accused me of looking at Miss Judith inappropriately. He threatened me. I told him to get out of my stable. He didn't appreciate a man like me speaking to him that way. We fought. *touches his cheek* He hits like a gentleman, not like a man who's worked with his hands."
    },
    {
      "condition": "Signs of struggle",
      "secret": "*slowly nods* It was Mr. Cavendish and me. He came in, all angry. Said he'd seen how I looked at his fiancée. *clenches his fists then relaxes them* I didn't deny it. Perhaps I should have. He threw the first punch. I defended myself, that's all. Afterward, he said he'd have me fired. *direct gaze* But he didn't say anything to Lord Blackwood. I wondered why... then I realized he didn't want Judith... Miss Judith to know what had happened."
    },
    {
      "condition": "Muddy boot prints",
      "secret": "*small joyless laugh* Muddy boots in the stable are like straw in the barn, sir. They're part of the scenery. These tracks... *examines* could be mine, or the stable boy's, or anyone else's. The horses need care, rain or shine."
    },
    {
      "condition": "Small firearm",
      "secret": "*surprised* Lady Blackwood had a weapon? I had no idea, sir. *reflects* She always seemed so fragile, so... subdued. But a mother protects her young, like a mare her foal. *more quietly* Maybe she sensed her daughter was in danger. Mothers know these things, sometimes before anyone else."
    },
    {
      "condition": "Message signed V",
      "secret": "*takes a deep breath* It's from me, sir. I wrote it after receiving her message about the 'important news.' *frank look* I wanted to meet her somewhere nobody would see us. The attic was our... our place. Nobody ever went there. *sadly* I waited that night. For a long time. When she didn't come, I... I was worried. I went down to her room."
    },
    {
      "condition": "Basin",
      "secret": "Yes, she had been sick for some time. *concerned* Especially in the mornings. She said it was nothing, just a passing ailment. *suddenly thoughtful* Now that I think about it... *stops, then almost whispers to himself* Oh my God... was she...? Did she want to tell me she was...? *briefly covers his face* Maybe that was the important news."
    },
    {
      "condition": "Scented tea cup",
      "secret": "*observes carefully* This smell... I've smelled it somewhere in the manor before. Not in the servants' quarters. *shakes head* This fingerprint isn't mine. *thinks* A crescent-shaped scar? *suddenly* Mr. Edgar! He has a mark like that on his thumb. He injured himself in his medical experiments. He was almost proud of it, called it his 'scholar's mark.' *worried* Why was he bringing tea to Miss Judith?"
    },
    {
      "condition": "Fresh muddy boot prints",
      "secret": "*visibly pales* Those are mine, sir. *trembling voice* That night, when she didn't come to the attic, I was worried. I waited, then I went down to her room. It was raining, my boots were muddy. *agitated* When I entered, she... she was there, in her bed. She was barely breathing. I tried to help her, but she wouldn't respond. *on the verge of tears* I panicked. I knew they would blame me. A man like me, in Lord Blackwood's daughter's bedroom? *straightens up* But I never hurt her. Never."
    },
    {
      "condition": "Empty alcohol bottles",
      "secret": "Mr. Edgar drinks a lot, yes. Everyone downstairs knows it. *shrugs* Sometimes, when he's had too much, he talks about Miss Judith. *hesitant* Once, I heard him say she should have been his, not Mr. Cavendish's. That he was more worthy of her. *frowns* He looked at her in a way that made me uncomfortable. Not the way a cousin should look at his cousin."
    },
    {
      "condition": "Edgar's personal journal",
      "secret": "*shocked* He loved her? Mr. Edgar? *shakes head, disgusted* That's... that's not right. She's his cousin. And the way he sometimes talked about her, as if she belonged to him... *clenches fists* So he was jealous of me? *sudden understanding* That would explain why he always looked at me with such contempt, even more than the others."
    },
    {
      "condition": "Laboratory equipment",
      "secret": "Yes, he has all sorts of strange instruments. *uncomfortable* He does experiments, mixtures. He's very proud of them. *lowers voice* Once, I saw him coming back from the cellar with plants. He jumped when he saw me, as if I'd caught him doing something wrong. *hesitation* It was a few days before Miss Judith started feeling ill."
    },
    {
      "condition": "Broken mirror",
      "secret": "I don't know anything about that, sir. I never enter Mrs. Holloway's room. *shivers slightly* She frightens me, to be honest. She looks at me as if I were less than a dog. *thinks* But she does have quite a temper. Once, I heard her shouting at Mr. Edgar. She was telling him he was weak, like his father. That she had to do everything herself, as always."
    },
    {
      "condition": "Arthur's father's letter",
      "secret": "*laughs bitterly* So that was it. They wanted the manor, not Judith. *shakes head* She suspected as much. She told me this marriage was just a transaction for her father. *intense gaze* We had planned to leave, you know. To leave everything behind. She said she preferred a simple life with me to a gilded cage with him. *sadly* We never got that chance."
    },
    {
      "condition": "Wet handkerchiefs",
      "secret": "Those belong to Martha. She cried a lot after her dismissal. *with compassion* She was devastated, not just about her job. *hesitation* She confided in me that her little brother was ill and she was sending half her wages for his care. Without her job... *shakes head* She loved Miss Judith like her own daughter. It was cruel to dismiss her like that."
    },
    {
      "condition": "Medical letter",
      "secret": "Yes, that's what she told me. Her brother is very ill. *sad* Martha was desperate after her dismissal. Without money, how could she help him? *angry* And all because of a theft accusation she never committed. *calmer* She told me before leaving that she had overheard something. A conversation between Mrs. Holloway and Mr. Edgar. Something about 'taking care of a situation.'"
    },
    {
      "condition": "Locket with photo",
      "secret": "*tears in his eyes, takes the locket reverently* I lost it that night. In the attic, I think, when I hurried down. *caresses the photo* It was our secret. She had it made in town. *smiles sadly* We went separately, of course. Two copies. One for each of us. To remind us of what we had, even when we were apart. *looks the detective in the eyes* I loved her, sir. Not the way a stable hand loves a lady. I loved her as a man loves a woman. And she loved me too."
    },
    {
      "condition": "Small shrub",
      "secret": "*frowns* I know this plant. Not its name, but I've seen it. *concentrated* Mr. Edgar went down to the cellar to get some, as I told you. And this smell... *suddenly alarmed* It's the same as in the cup! *understands the implication* Is this plant dangerous? *horrified* Is that what...? Did they...? *choked voice* My God, that's why she was dying when I found her. They poisoned her. *with fierce determination* Tell me you're going to make them pay for this, sir."
    },
    {
      "condition": "Jewelry box",
      "secret": "*steps back slightly* These are not matters that concern me, Sir. *respectful* I never go to the masters' quarters. My stable hands have never touched Lady Blackwood's fine things, I assure you. ▬ *observes curiously* These marks... they don't look like soot or dirt, Sir. It's too fine, too... worked. It looks like something that has been prepared, if you know what I mean."
    }
  ]
}
