{
  "secrets": [
    {
      "condition": "Burnt journal page",
      "secret": "*examines the paper carefully* This handwriting... it's Mr. Edgar's, I'm certain of it. *low voice* The 'M', that's his mother, Mrs. Holloway. *hesitant* I overheard a conversation between them, a few days before my dismissal. They were speaking in hushed tones in the library. Mrs. Holloway was saying they needed to 'take care of the situation' quickly. Mr. Edgar seemed worried, said they needed to be careful. *looks the detective straight in the eyes* It was after I overheard them that I was dismissed, Sir."
    },
    {
      "condition": "Dismissal letter",
      "secret": "*tears in her eyes* Yes, that's the letter Lady Blackwood gave me. *indignant* I never stole any jewelry, Sir! Never! I served the Blackwoods faithfully for over twenty years. *wipes away a tear* It was Mrs. Holloway who lied. She saw me near the library that day, when I overheard them. The next day, Lady Blackwood handed me this letter. *trembling voice* I couldn't even say goodbye to Miss Judith."
    },
    {
      "condition": "Scented tea box",
      "secret": "This tea belongs to Mrs. Holloway. *sniffs* I never liked that smell. *thoughtful* Lately, Mr. Edgar often brought tea to Miss Judith in the evening, but it wasn't this one... *frowns* It was another blend, with a more... forest-like smell. Like pine needles. I remember finding it strange that it wasn't me or Lady Blackwood preparing her tea as usual."
    },
    {
      "condition": "Lord Blackwood's will",
      "secret": "*looks at the document with respect* I've never seen it, of course. Lord Blackwood's affairs are private. *after explanation* I understand better now... Lord Blackwood was protecting the inheritance for Miss Judith's children. *nods* He was wary of the Cavendishes, that doesn't surprise me. *lowers voice* I once heard Lord Blackwood and Mr. Arthur arguing. Lord Blackwood told him he would never have 'the keys to the kingdom' as long as he was alive."
    },
    {
      "condition": "Hidden message",
      "secret": "*immediately recognizes* That's Miss Judith's handwriting! *touched* She often left little notes like this one... *reflects* 'Important news'... *suddenly emotional* Oh, Lord. She was sick every morning. I cleaned her nausea Basin without saying anything. *looks at the detective* I believe Miss Judith was pregnant, Sir. And I believe she wanted to tell Victor."
    },
    {
      "condition": "Ring with initials",
      "secret": "Mr. Cavendish's signet ring. *grimaces* He lost it when he fought with Victor in the stables. *determined* I saw everything from the office window. Mr. Cavendish was accusing him of looking at Miss Judith 'inappropriately'. He struck Victor first. *nods* Victor defended himself, as any man would. Mr. Cavendish left furious, without his ring. He threatened to have Victor fired."
    },
    {
      "condition": "Signs of struggle",
      "secret": "As I told you, it was between Mr. Cavendish and Victor. *disappointed* Nobody did anything. The servants didn't dare intervene against Miss Judith's fiancé. *sighs* Victor had a split lip, but he didn't tell anyone about it. *sad* He knew his word would mean nothing against Mr. Cavendish's. That's how things go for people like us, Sir."
    },
    {
      "condition": "Muddy boot prints",
      "secret": "*small smile* In a stable, boot prints are as common as dust in an attic, Sir. *thinks* These could be Victor's, or the stable boy's, or even Mr. Edgar's. *hesitant* He often went to the stables lately, to talk to Victor. Their conversations seemed... tense. Mr. Edgar often observed Victor when he was with Miss Judith."
    },
    {
      "condition": "Small firearm",
      "secret": "*surprised* Lady Blackwood had a weapon? *reflects* I didn't know that, but it doesn't surprise me that much. *low voice* She was very worried about Miss Judith lately. I heard her tell her daughter to be careful, not to walk alone. *hesitant* I think she sensed that something wasn't right in this house. A mother feels these things."
    },
    {
      "condition": "Message signed V",
      "secret": "*sadly nods* It's from Victor, yes. *emotional* They sometimes met in the attic, where nobody ever went. *defends* Don't judge them too harshly, Sir. They loved each other sincerely. *sighs* Miss Judith was promised to a man who didn't love her, and Victor... Victor adored her. He would have done anything for her. *firmly* But he would never have hurt her. Never."
    },
    {
      "condition": "Basin",
      "secret": "*nods* I cleaned it every morning. *gently* Poor dear, she was sick upon waking for several weeks. Lady Blackwood said it was a persistent flu, but... *looks at the detective* An old governess like me recognizes the signs, Sir. *determined* Miss Judith was expecting a child. I'd stake my life on it. And the father could only be Victor."
    },
    {
      "condition": "Scented tea cup",
      "secret": "*steps back slightly* That smell... *wrinkles nose* It's from the tea Mr. Edgar brought to Miss Judith. *examines the fingerprint* And that mark is his. He's had that scar on his thumb since an accident in his university laboratory. *serious* He insisted on bringing her this tea himself, said it was good for her 'illness'. But after drinking it, she always seemed weaker than before."
    },
    {
      "condition": "Fresh muddy boot prints",
      "secret": "*examines carefully* These tracks... they look like Victor's boots. *thoughtful* If he went up to see her that night, it was surely because she didn't show up at the attic. *defends him* Victor loved Miss Judith, Sir. If he entered her room, it was out of concern, not with bad intentions. *pleading* Please don't accuse him wrongly, I beg you. Look instead for who was preparing that strange tea."
    },
    {
      "condition": "Empty alcohol bottles",
      "secret": "*disapproving look* Mr. Edgar drinks too much, always has. *shakes head* Mrs. Holloway constantly defends him, makes excuses. *darker* Alcohol makes him... different. Once, I caught him looking at a portrait of Miss Judith while muttering... disturbing things. He was talking as if she belonged to him. *shivers* When he saw me, his gaze was so cold that I was frightened."
    },
    {
      "condition": "Edgar's personal journal",
      "secret": "*not surprised* I suspected as much. *disgusted* The way he looked at her wasn't how a cousin should. *remembers* Once, I overheard Mrs. Holloway telling him that Judith would have been perfect for him, if only she hadn't been promised to Mr. Cavendish. *indignant* To speak of her own niece that way! *sincere* Mr. Edgar became increasingly obsessed with Miss Judith, especially after discovering about her and Victor."
    },
    {
      "condition": "Laboratory equipment",
      "secret": "Yes, all those strange instruments... *distrustful* Mr. Edgar installed them as soon as he returned from university. *frowns* I saw him several times coming back from the cellar with plants, late at night. He handled them with gloves, very cautiously. *worried* It was shortly after that he began bringing that special tea to Miss Judith. And that's when she started to become ill..."
    },
    {
      "condition": "Broken mirror",
      "secret": "*nods* I'm not surprised. Mrs. Holloway has a terrible temper. *hesitant* The morning when Miss Judith was discovered, I was... well, I had been dismissed, but I hadn't left yet. *lowers voice* I heard a loud crash coming from her room, then sobbing. Not sobs of grief, Sir. Sobs of rage. Then I heard her tell her son: 'This wasn't supposed to happen like this.'"
    },
    {
      "condition": "Arthur's father's letter",
      "secret": "*raised eyebrows* So it was that. *not surprised* The servants suspected the Cavendishes were mostly interested in the property. *indignant* Poor Miss Judith, treated like a mere bargaining chip. *shaking head* Lord Blackwood must have known their intentions. That's probably why he made that special will. At least he tried to protect the estate, if not his daughter."
    },
    {
      "condition": "Wet handkerchiefs",
      "secret": "*emotional* Those are mine. *wipes away a tear* I cried so much after receiving that dismissal letter. *desperate* Not only was I losing my place with Miss Judith, whom I practically raised, but I could no longer send money to my sick brother. *determined look* I knew Mrs. Holloway was lying, that it was to get me away because I had heard too much. But nobody listened to me."
    },
    {
      "condition": "Medical letter",
      "secret": "*takes the letter with emotion* Yes, this is the letter from my brother's doctor. *clutches it to her chest* He is seriously ill, Sir, and the treatments are expensive. *broken voice* Without my salary, I can no longer help him. *determined* That's why I came back to the manor that morning, to beg Lady Blackwood to reconsider. *sad* That's when I heard the screams... Miss Judith was dead."
    },
    {
      "condition": "Locket with photo",
      "secret": "*smiles sadly* Ah, their locket... *touches it delicately* Miss Judith showed it to me, in secret. They each had one. *moved* They truly loved each other, Sir. Not like those arranged marriages of high society. A genuine love. *sighs* She talked about running away with him, starting a new life far from here. *tears in her eyes* I should have encouraged her more. Perhaps she would still be alive."
    },
    {
      "condition": "Small shrub",
      "secret": "*backs away, horrified* It's that plant! *trembling* I saw it in Mr. Edgar's hands several times. *suddenly understands* That smell... it's exactly the one from the tea he brought to Miss Judith! *puts her hand to her mouth* My God... they poisoned her. *furious and in tears* Mrs. Holloway discovered about the pregnancy, I'm certain of it. She always said a scandal would be the end of the Blackwoods. *looks at the detective* Edgar prepared the poison, but it was his mother who pushed him to do it. I swear on the Bible, Sir, that's the truth."
    },
    {
      "condition": "Jewelry box",
      "secret": "*immediately recognizes* Those are Lady Blackwood's jewels! *indignant* I told you, I never touched her jewelry! ▬ *examines carefully* These traces... they look like makeup powder, Sir. Not ordinary dirt."
    }
  ]
}
