{
  "secrets": [
    {
      "condition": "Burnt journal page",
      "secret": "*takes the paper with a trembling hand* I don't recognize this handwriting... *examines more carefully* But this way of forming letters... It looks like Edgar's. *hesitant* Margarett can be very... insistent when she wants something. She has always exerted a strong influence on her son. *returns the paper* I don't know what this means, but Edgar seemed troubled lately. He avoided my gaze during meals."
    },
    {
      "condition": "Dismissal letter",
      "secret": "*lowers her eyes* Yes, that is my handwriting. *weak voice* Margarett told me she caught Martha going through my jewelry box. I... I found it hard to believe. Martha served us faithfully for so many years. *tears in her eyes* Judith loved her dearly. Perhaps I acted too hastily, but Margarett was so convincing... so insistent."
    },
    {
      "condition": "Scented tea box",
      "secret": "This tea belongs to Margarett. She is very particular about her beverages. *slight grimace* She tried to make me drink it, but I don't like the taste. *thoughtful* Judith didn't like it either. I usually prepared her evening tea, with honey as she liked it... *stops* Lately, however, Margarett or Edgar often brought it to her."
    },
    {
      "condition": "Lord Blackwood's will",
      "secret": "*reviews the document* My husband has always been careful with family matters. *sighs* He was suspicious of Arthur's and his family's intentions. *soft voice* Judith wasn't happy about this arranged marriage, you know. She tried to please her father, but her heart... *interrupts herself* Lord Blackwood may seem strict, but he wanted to protect the family inheritance. It was his way of taking care of Judith."
    },
    {
      "condition": "Hidden message",
      "secret": "*immediately recognizes the handwriting* This is my daughter's handwriting. *gently touches the paper* She had 'important news'... *her face falls* Oh God... I think I know what it was about. *silent tears* The morning sickness, her constant fatigue... How could I not see? *looks at the detective with despair* I believe my daughter was pregnant, Sir."
    },
    {
      "condition": "Ring with initials",
      "secret": "That's Arthur's signet ring, yes. *perplexed* In the stables? That's strange. *thinks* He was furious one evening at dinner. He had a scratch on his face that he attributed to falling from a horse. *hesitant* Arthur is a proud man, sometimes angry. He... he didn't like the way Judith spoke to the staff. Particularly to that young stable hand, Victor."
    },
    {
      "condition": "Signs of struggle",
      "secret": "*worried* An altercation? I wasn't aware of that. *thoughtful* Arthur returned one evening with his clothes in disarray. He claimed to have been inspecting the horses, but he seemed agitated. *low voice* He asked Lord Blackwood if all the servants were well chosen. My husband didn't understand the allusion, but I suspected Arthur was referring to Victor."
    },
    {
      "condition": "Muddy boot prints",
      "secret": "I rarely go to the stables, Detective. *sad smile* Judith, on the other hand, spent a lot of time there. She loved horseback riding since childhood. *hesitation* These past few months, her rides had become more frequent. I told myself it was to escape the pressure of the upcoming marriage, but perhaps... *stops* perhaps there was another reason."
    },
    {
      "condition": "Small firearm",
      "secret": "*doesn't seem surprised* Yes, this weapon belongs to me. *regained dignity* I acquired it a few months ago, when I began to fear for my daughter. *determined* Judith was changing, she seemed... preoccupied. She was receiving strange looks from certain people in this house. *direct gaze* I didn't know exactly where the danger lay, but a mother senses these things. I should have been more vigilant."
    },
    {
      "condition": "Message signed V",
      "secret": "*briefly closes her eyes* Victor. *sighs* I knew about the two of them. *weary look* A mother knows her daughter. I caught their glances, their brushing of hands when they thought no one was watching. *firmer voice* I tried to dissuade Judith. Not out of disapproval - Victor is a good boy - but out of fear of the consequences if my husband found out."
    },
    {
      "condition": "Basin",
      "secret": "*painful nod* She was sick almost every morning. *wrings her hands* I brought her water, fresh cloths. I thought... I wanted to believe it was just a minor ailment. *sobs softly* But deep down, I knew. A mother knows. She was carrying a child. Victor's child. *raises her head* She was going to tell me, wasn't she? That was her 'important news'."
    },
    {
      "condition": "Scented tea cup",
      "secret": "*slightly sniffs the cup, steps back* This smell... this isn't the tea I prepared for Judith. *examines the fingerprint* This crescent-shaped mark... it's Edgar's. He injured himself during his medical studies. *pale face* Lately, he often insisted on bringing the tea to Judith himself. I found it thoughtful, but... *horrified* My God, what has he done?"
    },
    {
      "condition": "Fresh muddy boot prints",
      "secret": "*surprised* Boot prints in her room? *thinks* The night she... *stops, unable to say the word* I heard footsteps in the hallway, late at night. I thought it was Judith going to the bathroom. *hesitant* Could it be Victor? Perhaps he came to see her? *worried* You should talk to him, but... don't judge him too harshly, Detective. If he truly loved her..."
    },
    {
      "condition": "Empty alcohol bottles",
      "secret": "*sad sigh* Edgar drinks too much, has for a long time. Margarett always excuses him, says it's the stress of his studies. *shaking her head* But alcohol changes him. He becomes... different. Darker. *hesitant* Once, I heard him talking about Judith in a way that made me uncomfortable. There was an obsession in his voice. I mentioned it to Margarett, but she dismissed my concerns."
    },
    {
      "condition": "Edgar's personal journal",
      "secret": "*horrified* Edgar was... in love with Judith? His own cousin? *covers her mouth* I had noticed that he sometimes looked at her strangely, but I would never have imagined... *shivers* Margarett always encouraged this closeness between them. She said they would make a beautiful couple if circumstances were different. I found this comment inappropriate, but I didn't really think about it... until now."
    },
    {
      "condition": "Laboratory equipment",
      "secret": "Yes, Edgar has set up a kind of laboratory in his room since his return. *concerned* Margarett is very proud of it. She says he's continuing his medical research. *hesitant* He spent a lot of time locked in there, especially these past few weeks. I saw him several times going down to the cellar and coming back up with plants. He said he was studying their medicinal properties."
    },
    {
      "condition": "Broken mirror",
      "secret": "*surprised* I wasn't aware of the mirror. *thinking* Margarett has always had a... volatile temperament. We heard a loud noise coming from her room the morning we discovered... *stops* I thought it was an expression of her grief, but... *thoughtful* She seemed more agitated than sad, now that I think about it. As if something hadn't gone as planned."
    },
    {
      "condition": "Arthur's father's letter",
      "secret": "*sad but not surprised* We suspected as much. *soft voice* Lord Blackwood knew the Cavendishes' intentions, that's why he had this special will drawn up. *sighs* Judith was just a means for them to acquire Blackwood Manor. *bitter* My poor child, promised to a man who saw in her only a path to property. She deserved so much better. She deserved to be loved."
    },
    {
      "condition": "Wet handkerchiefs",
      "secret": "*moved* Those are Martha's handkerchiefs. She was crying so much when I gave her the dismissal letter. *full of regrets* I should never have trusted Margarett. Martha served our family faithfully for years. *trembling voice* She loved Judith like her own daughter. Her dismissal, just before this tragedy... I wonder if she had seen or heard something."
    },
    {
      "condition": "Medical letter",
      "secret": "*deeply troubled* I didn't know... Martha never told me about her sick brother. *covers her face with her hands* If I had known she needed money for medical care... I would never have believed she could steal. *cries softly* She must have been desperate. And now, without her salary... *looks at the detective* I must find her, help her in some way."
    },
    {
      "condition": "Locket with photo",
      "secret": "*takes the locket tenderly* They look so happy... *silent tears* I knew they loved each other. I saw it in my daughter's eyes. *softly* Victor may have been just a stable hand, but he sincerely loved Judith. More than Arthur would ever have loved her. *caresses the photo* I didn't have the courage to defend their love against my husband. I hoped that with time... *sobs* I should have done more. I should have protected them."
    },
    {
      "condition": "Small shrub",
      "secret": "*steps back, horrified* This plant... My father-in-law used it for his decoctions. He said it had medicinal properties, but could be dangerous in large doses. *realization* That's the smell! *trembling* Judith's tea smelled like this lately. When Edgar brought it to her. *covers her mouth* Lord... Was my daughter...? *sobs* Edgar and Margarett... did they really...? No, it's impossible... and yet..."
    },
    {
      "condition": "Jewelry box",
      "secret": "*delicately takes the box* Yes, these are my jewels. *grasps the blackened ring* Oh my God, look at the state it's in! *sighs* I'll have to clean them. *trembling voice* Why are you showing me this, Detective? It brings back so many memories... ▬ *examines more closely* These marks... they look like makeup powder, but it's not the type of complexion I use. Mine is much lighter."
    }
  ]
}
