{
  "secrets": [
    {
      "condition": "Burnt journal page",
      "secret": "*examines the paper with detachment* I'm not familiar with this handwriting. 'M' could be Margarett Holloway, I imagine? *shrugs* That woman has always had a strong personality. Quite intimidating, if you want my opinion. *returns the paper* I don't see how these scribblings relate to my engagement with Judith or... her tragic disappearance."
    },
    {
      "condition": "Dismissal letter",
      "secret": "The governess's dismissal? *indifferent air* Domestic affairs are Lady Blackwood's responsibility, not mine. I've barely exchanged a few words with this... Martha, is that right? *adjusts his cuff* Staff come and go, it's the natural order of things. If she was caught stealing, her dismissal was perfectly justified. A house like Blackwood Manor deserves impeccable staff."
    },
    {
      "condition": "Scented tea box",
      "secret": "*delicately sniffs* A delicate fragrance. This tea belongs to Mrs. Holloway, if I'm not mistaken. *smiles politely* Judith preferred more traditional blends, I believe. *pause* We never really discussed her tea preferences, to be honest. Our conversations focused on more... substantial subjects."
    },
    {
      "condition": "Lord Blackwood's will",
      "secret": "*visibly annoyed* Yes, I am aware of these... particular provisions. *clears throat* Lord Blackwood informed me shortly after our engagement. A simple precaution, he assured me. *slightly bitter tone* A perfectly understandable mark of prudence on his part. *forced smile* Our union was not a question of property, but of alliance between two great families. This arrangement never... overly concerned me."
    },
    {
      "condition": "Hidden message",
      "secret": "*frowns* That is indeed Judith's handwriting. 'Important news'? *seems to reflect* She didn't share any news with me. We didn't have any private conversations in the days before her... *stops* I wonder who this message was intended for. *colder tone* Judith could be rather... secretive at times. I respected her privacy, of course."
    },
    {
      "condition": "Ring with initials",
      "secret": "*obvious surprise* My signet ring! I was looking for... *composes himself* Yes, it belongs to me. *hesitates* I lost it during a visit to the stables. I was inspecting the horses, naturally. *adjusts his tie* As the future master of the house, I needed to be familiar with all aspects of the estate. *lower tone* I don't see why this personal item interests you, Detective."
    },
    {
      "condition": "Signs of struggle",
      "secret": "*visibly uncomfortable* An altercation? *unconsciously touches his cheek* Ah, you may be referring to... *sighs* Very well. I had a disagreement with that stable hand, Victor. *haughty tone* His attitude toward Judith was inappropriate. Too familiar. I simply reminded him of his place. *disdainful* He had the audacity to answer back, and things became... somewhat heated. A matter of no importance."
    },
    {
      "condition": "Muddy boot prints",
      "secret": "*barely looks* Boot prints in a stable? *slightly mocking tone* Is that really surprising, Detective? *hand gesture* This place is frequented by men who work in mud all day. *haughty* I rarely go there myself, and always with appropriate boots. I doubt these tracks have any relevance to your investigation."
    },
    {
      "condition": "Small firearm",
      "secret": "*raised eyebrows* Lady Blackwood owned a weapon? *apparent surprise* I was completely unaware of its existence. *thoughtful* She always seemed so... gentle. Almost withdrawn. *hesitates* Perhaps she feared something... or someone? *looks at the detective* These large, isolated mansions can be intimidating for a woman of fragile constitution. I wouldn't blame her for wanting to feel safe."
    },
    {
      "condition": "Message signed V",
      "secret": "*face hardens* 'V'... Victor, I presume. *clenched jaw* I was right, then. That servant was taking liberties with my fiancée. *furious but controlled* A meeting in the attic? That's... that's absolutely scandalous. *breathes deeply* I suspected something of this sort. The way he looked at her... *piercing gaze* Have you questioned this Victor, Detective? I believe you have your prime suspect there."
    },
    {
      "condition": "Basin",
      "secret": "Yes, Judith had been unwell lately. *indifferent* Lady Blackwood informed me that she had some... morning discomforts. Nothing serious, I was assured. *hesitation* I didn't insist on seeing her during her illness. It wouldn't have been... proper. *detached tone* Female matters of this kind are better handled by the mother or the servants."
    },
    {
      "condition": "Scented tea cup",
      "secret": "*examines the cup without touching it* This fingerprint is not familiar to me. *sniffs slightly* This odor is distinctive, indeed. Not the usual house tea. *thinks* Edgar has a similar scar on his thumb, I believe. The result of a laboratory accident, from what he told me. *shrugs* He often brought remedies to Judith during her illness. Very... attentive of him."
    },
    {
      "condition": "Fresh muddy boot prints",
      "secret": "*shocked and indignant* Muddy boots in my fiancée's bedroom? That's outrageous! *accusatory tone* Who would have the audacity...? *stops, then with conviction* Victor. It can only be him. This message to the attic, now these tracks... *furious* That stable hand broke into her room the night of her death! *looks intensely at the detective* There's your culprit, Sir. I've always known. He coveted her in a... unhealthy manner."
    },
    {
      "condition": "Empty alcohol bottles",
      "secret": "*slight condescending smile* Edgar and his weakness for the bottle. An open secret in this house. *confidential tone* Between us, I find him somewhat... unstable when he drinks. *hesitation* I've caught his gaze on Judith several times. A look that wasn't that of a cousin. *suggests* Perhaps you should examine his actions more closely these past few days, Detective."
    },
    {
      "condition": "Edgar's personal journal",
      "secret": "*triumphant* So I was right! Edgar harbored inappropriate feelings for my fiancée. *obvious disgust* To develop such attachment to his own cousin... it's unhealthy. *calculating look* And with his penchant for alcohol, who knows how far he might have gone? Jealousy is a powerful motive, Detective. *insinuating* Perhaps he couldn't bear the idea that Judith belonged to me."
    },
    {
      "condition": "Laboratory equipment",
      "secret": "Ah yes, Edgar's 'laboratory.' *slightly mocking tone* He likes to parade his medical knowledge. *thoughtful* I've seen him handle all sorts of strange substances. *more serious* A man who knows poisons, who has a passionate motive, and who had access to Judith's room... *pointed look* This equipment could have been used for purposes far more sinister than simple 'experiments,' don't you think?"
    },
    {
      "condition": "Broken mirror",
      "secret": "*surprised* I wasn't aware of that. *reflects* Mrs. Holloway has always had a... volcanic temperament. *hesitant* Judith's death affected us all, of course, but... *lowers voice* I sometimes sensed a certain... tension between Margarett and Judith. Nothing open, but looks, remarks... *insinuating* Margarett seemed to consider that no one was good enough for her precious son, not even Judith."
    },
    {
      "condition": "Arthur's father's letter",
      "secret": "*visibly pales* This letter... *quickly composes himself* My father's affairs don't directly concern me, Detective. *defensive tone* Of course, Blackwood Manor's property is impressive, but my commitment to Judith was sincere. *adjusts his jacket* Financial considerations are part of every marriage in our circle. It's pragmatic, not... criminal. *direct gaze* This letter has nothing to do with Judith's death."
    },
    {
      "condition": "Wet handkerchiefs",
      "secret": "*impatient* Used handkerchiefs? I don't see the point in dwelling on a servant's tears. *disdainful tone* This Martha was perhaps attached to Judith, like all the servants in the house. My fiancée had the gift of earning the staff's loyalty. *looks away* A talent I admired, although I found she was sometimes too... familiar with them."
    },
    {
      "condition": "Medical letter",
      "secret": "*indifferent* The personal problems of servants hardly interest me, Detective. *examines the letter* A sick brother? That's regrettable, of course. *detached tone* But if this Martha needed money, that strengthens the theft theory, doesn't it? *insinuating* Desperation can drive one to reprehensible acts. Perhaps she discovered something about Judith's death and was dismissed to silence her?"
    },
    {
      "condition": "Locket with photo",
      "secret": "*barely contained fury* What is...? *takes the locket, hands trembling* Judith and that... that stable hand? *face contorted with anger* So my suspicions were founded. She was betraying me. With a servant! *almost throws the locket* This is an unforgivable betrayal. A humiliation! *composes himself, icy voice* There's your motive, Detective. This Victor dishonored my fiancée. When she wanted to break it off with him, he killed her. It's obvious."
    },
    {
      "condition": "Small shrub",
      "secret": "*examines cautiously* I'm not familiar with plants. *steps back slightly* If this one is toxic, as you say, its presence here is concerning. *reflects* I know Edgar went down to the cellar often. For his 'experiments,' he said. *suggestive tone* A doctor would have knowledge of such a plant's toxic properties, wouldn't he? *direct gaze* Between his obvious jealousy and his access to poisons, your investigation should perhaps focus on him, Detective."
    },
    {
      "condition": "Jewelry box",
      "secret": "*examines the jewelry with evident interest* An impressive collection. *delicately picks up a ring* The craftsmanship is exquisite... family heirlooms, no doubt? *quickly puts it back* Judith had told me about some of these pieces. *forced nostalgic tone* She planned to wear them on our wedding day. *pause* I suppose now... *leaves his sentence hanging* Inheritance matters are so complex in these tragic circumstances. ▬ *annoyed tone* Really, Detective, I have other concerns than discussing dirt stains. This investigation should focus on more substantial elements."
    }
  ]
}
