{
  "secrets": [
    {
      "condition": "Burnt journal page",
      "secret": "I... it's... *visibly hesitates, his hand trembling slightly*. I don't recognize this handwriting. My mother is sometimes very... determined in her opinions, as you know. But I don't see what this could mean. Perhaps a note from a servant regarding household chores? *looks away*"
    },
    {
      "condition": "Dismissal letter",
      "secret": "Ah, Martha's dismissal. It was regrettable. I always found her devoted and reliable. My mother was convinced she had stolen jewelry, although... *stops*. I wasn't directly involved in this decision. Martha seemed devastated, but in a large house like this one, servants come and go, don't they?"
    },
    {
      "condition": "Scented tea box",
      "secret": "This tea belongs to my mother. She orders it specially from London. I'm not a great tea enthusiast myself, I prefer... *gestures toward an invisible bottle*. Some teas can have interesting medicinal properties, it's a subject I briefly studied during my training. This one, I believe, is simply flavored for pleasure."
    },
    {
      "condition": "Lord Blackwood's will",
      "secret": "My uncle's will? I wasn't aware of the specific details. He doesn't trust me enough to share such information. So Judith was to inherit and not Arthur... *seems thoughtful*. My uncle has always been cautious with his assets. I suppose he was wary of Arthur's intentions, which was wise given... *stops*. Well, that doesn't matter anymore now, does it?"
    },
    {
      "condition": "Hidden message",
      "secret": "A message from Judith? She may have had something to announce... *seems uncomfortable*. I wasn't aware of this note. Judith and I weren't... as close lately. What important news could it be about? *nervous laugh* Perhaps she wanted to postpone her marriage? That would certainly have upset my uncle."
    },
    {
      "condition": "Ring with initials",
      "secret": "Arthur's signet ring in the stables? That's curious. I saw him go there several times in recent weeks. He seemed... preoccupied by something. *smiles slightly* Perhaps he suspected what everyone else ignored. Arthur has always had a jealous temperament, you know. Not the kind of man I would have chosen for Judith."
    },
    {
      "condition": "Signs of struggle",
      "secret": "A fight? *seems interested* I wasn't aware. But that would explain why Arthur was so agitated at dinner that evening. He had a slight scratch on his cheek that he attributed to a tree branch. *pause* You think he fought with someone? One of the stable hands perhaps? *hesitation* Victor, maybe?"
    },
    {
      "condition": "Muddy boot prints",
      "secret": "Boot prints in a stable, is that really so surprising? *smiles nervously* They could belong to anyone. Victor works there daily, of course. Arthur would go there occasionally. I myself ventured there at times to... observe the horses. *shrugs* It's difficult to draw any conclusion from this."
    },
    {
      "condition": "Small firearm",
      "secret": "My aunt owned a weapon? *seems genuinely surprised* I had no idea. She has always seemed so... fragile. Perhaps she feared something... or someone? *thinks* Judith could have been in danger, I suppose. Or maybe Lady Blackwood felt threatened herself? It's quite disturbing."
    },
    {
      "condition": "Message signed V",
      "secret": "'V'... *his face tenses slightly* That would be Victor, I presume. The stable hand. *colder tone* I've seen him looking at Judith in an... inappropriate way. A servant addressing the daughter of the house like this? It's scandalous. *looks away* I wonder if my uncle is aware of these... meetings."
    },
    {
      "condition": "Basin",
      "secret": "Yes, Judith had been ill for some time. Morning sickness mainly. *hesitates, then adopts a professional tone* From a medical perspective, such symptoms can indicate various conditions. A simple flu, food poisoning... or... *stops abruptly* My aunt thought it wasn't anything serious, just a passing ailment."
    },
    {
      "condition": "Scented tea cup",
      "secret": "*visibly pales, unconsciously touches his right thumb* This... this cup... *tries to regain composure* Judith often drank tea in the evening. To help her sleep. Sometimes I... I brought it to her myself. This smell? *nervous* Probably a herbal blend. Some essential oils have soothing properties. The fingerprint? I couldn't say who it belongs to."
    },
    {
      "condition": "Fresh muddy boot prints",
      "secret": "Muddy boots in Judith's room? *frowns* That's strange, indeed. A servant, perhaps? Or... *hesitation* someone else? Would Victor have had the audacity to enter her room? *seems to be thinking intensely* These tracks could be crucial to your investigation, Detective. Someone was with her that night..."
    },
    {
      "condition": "Empty alcohol bottles",
      "secret": "*embarrassed laugh* Yes, they're mine. Medical studies are... demanding. I sometimes need a little help to relax. My mother disapproves, of course, but she doesn't understand the pressure I'm under. *more serious* It doesn't affect my abilities in any way, I assure you. I remain perfectly lucid and... responsible for my actions."
    },
    {
      "condition": "Edgar's personal journal",
      "secret": "*turns very pale* You read my journal? That's... that's a violation of my privacy! *pause, then more calmly* Yes, I had affection for Judith. We grew up together, after all. My feelings were... complex. *sighs* But I would never have... I knew she was promised to Arthur. I would never have acted on these feelings. Never."
    },
    {
      "condition": "Laboratory equipment",
      "secret": "Ah, my equipment. *seems more at ease* I continue my research even here. A doctor must stay current, you understand. I particularly study plant extracts and their medicinal applications. *vague gesture* Nothing extraordinary. Just some harmless experiments. Chemistry has always been my passion, since university."
    },
    {
      "condition": "Broken mirror",
      "secret": "My mother's mirror? *seems confused* She has a... lively temperament. Judith's death affected all of us deeply. My mother and Judith weren't always on good terms, but they remained family. *hesitation* The blood? Probably my mother cutting herself while picking up the pieces. Nothing more."
    },
    {
      "condition": "Arthur's father's letter",
      "secret": "*smiles bitterly* This confirms what I suspected. The Cavendishes were only interested in the property. Arthur claimed to love Judith, but... *shakes head* Was my uncle aware of this? Probably. He's not naive in business matters. Poor Judith, reduced to a mere bargaining chip. She deserved so much better."
    },
    {
      "condition": "Wet handkerchiefs",
      "secret": "Martha, no doubt. *seems embarrassed* Her dismissal was unfair. She never stole anything, I'm certain of it. My mother... *stops* The poor woman served faithfully for years. I spoke to her briefly before her departure. She seemed devastated, and not just about her job. She was worried about someone, I believe."
    },
    {
      "condition": "Medical letter",
      "secret": "Ah, so that's it. *sighs* I didn't know her brother was ill. That explains her despair after her dismissal. *seems genuinely saddened* Without income, how could she pay for medical care? It's... regrettable. Had I known, I could have intervened from a medical standpoint, perhaps. Money is often a cruel obstacle to care."
    },
    {
      "condition": "Locket with photo",
      "secret": "*expression of evident pain* So it was true. Judith and that... stable hand. *looks away* I suspected something, their glances, their supposedly chance meetings. *bitterness in voice* She chose him, a simple servant. *pause* Is my uncle aware? It would destroy him, all his ambitions for Judith reduced to nothing by this... misalliance."
    },
    {
      "condition": "Small shrub",
      "secret": "*visibly flinches* Savin juniper? *tries to appear detached* It's a fairly common plant in old mansions. Medicinal properties, of course, but also... *hesitates* certain risks if misused. *adopts a professorial tone* Traditionally used for various ailments, although modern medicine considers it dangerous, particularly for... *stops* certain people. Its oil has a characteristic odor, as you can observe."
    },
    {
      "condition": "Jewelry box",
      "secret": "*glances briefly at the box* My aunt's jewelry. *detached tone* They look a bit tarnished. My mother knows more about these feminine trinkets. *shrugs* I don't see the point of these baubles for your investigation, Detective. ▬ *looks vaguely* Traces? Probably dust or dirt. The servants don't always pay attention when they clean."
    }
  ]
}
