{
  "secrets": [
    {
      "condition": "Burnt journal page",
      "secret": "This appears to be inconsequential scribbles. Perhaps from one of the servants? I don't recognize the handwriting. Margarett sometimes has strong opinions about how the house should be run, but I hardly see how this relates to my daughter's death. I suggest you focus on more substantial evidence, Detective."
    },
    {
      "condition": "Dismissal letter",
      "secret": "Ah yes, Martha's dismissal. My wife informed me that this woman had been caught stealing family jewels. I trusted Lady Blackwood's judgment in this matter. Martha had served us for many years, which made the betrayal all the more disappointing. I was not directly involved in her dismissal, but I certainly supported the decision. It is increasingly difficult to find good staff these days."
    },
    {
      "condition": "Scented tea box",
      "secret": "This tea belongs to my sister, Margarett. She has always been particular about her beverages. I believe she brought it back from London during her last visit. I don't indulge in such frivolities myself—a simple strong black tea in the morning suffices for me. I don't see how this could be connected to your investigation."
    },
    {
      "condition": "Lord Blackwood's will",
      "secret": "Yes, that is indeed my will. It is perfectly normal for a man in my position to ensure that the family estate remains in the bloodline. The provisions simply state that Blackwood Manor must pass to Judith's children, not to her husband. The Cavendish family has a respectable name but questionable finances. I was not going to allow our ancestral home to be seized to repay Arthur's family's debts. This is simply prudent estate planning, Detective, nothing more."
    },
    {
      "condition": "Hidden message",
      "secret": "I am not familiar with this note. My daughter sometimes left messages in books for her mother—they shared a love of literature. The 'important news' could refer to anything. Perhaps preparations for the wedding? Judith had many responsibilities in organizing the event. I would not place too much importance on such a vague message."
    },
    {
      "condition": "Ring with initials",
      "secret": "This appears to be Arthur Cavendish's signet ring. What it was doing in the stables, I couldn't say. Perhaps he dropped it while inspecting the horses? Arthur was to marry my daughter—he had every right to be anywhere on the estate. I don't see the significance of this."
    },
    {
      "condition": "Signs of struggle",
      "secret": "I was not aware of any altercation in the stables. Arthur may have had words with one of the stable hands regarding the proper care of his mount. He has high standards, as one would expect from a gentleman. If there was any misconduct among the staff, I should have been informed immediately. This is very concerning."
    },
    {
      "condition": "Muddy boot prints",
      "secret": "Detective, this is a stable. There are always muddy boots there. The stable hands, the gardener, visitors—many people come and go. I don't see how this constitutes evidence of anything other than people doing their jobs."
    },
    {
      "condition": "Small firearm",
      "secret": "I... was not aware that my wife possessed such an object. Lady Blackwood has always been of a nervous disposition, particularly since Judith's birth. Perhaps she felt she needed protection when I was away on business. I will have to speak with her about this. It is most improper for a lady to keep such things without her husband's knowledge."
    },
    {
      "condition": "Message signed V",
      "secret": "I have no knowledge of this message or who this 'V' might be. Why would someone arrange a meeting with my daughter in the attic? This area is rarely used except for storage. It's very strange and inappropriate. Perhaps one of the servants was trying to entice my daughter into some impropriety. If that's the case, they will be dismissed immediately."
    },
    {
      "condition": "Basin",
      "secret": "My daughter had been unwell for some time. Lady Blackwood thought it was simply a passing illness—nothing serious. I had suggested calling Dr. Harrison, but my wife insisted it wasn't necessary. Women often know more about these matters of health, so I deferred to her judgment. In hindsight, perhaps I should have insisted."
    },
    {
      "condition": "Scented tea cup",
      "secret": "I wouldn't know whose fingerprint this is, although that unusual crescent-shaped scar seems distinctive. My daughter enjoyed her evening tea—a family tradition. Lady Blackwood often prepared it for her. The scent you mention is unfamiliar to me. Perhaps you should question my sister or my nephew about it—Edgar has some knowledge of plants and their properties thanks to his medical studies."
    },
    {
      "condition": "Fresh muddy boot prints",
      "secret": "What? Muddy boots in my daughter's room? That's outrageous! No one should have entered her chamber that night, except perhaps my wife or one of the maids. Certainly no one wearing work boots would have had a legitimate reason to be there. This suggests an intruder—perhaps the true culprit of this tragedy. I demand you investigate this immediately!"
    },
    {
      "condition": "Empty alcohol bottles",
      "secret": "My nephew has always had certain... weaknesses of character. His alcohol consumption is disappointing but hardly unusual for young men his age. I've spoken to Margarett about it several times, but she's quite protective of her son. Edgar recently completed his medical studies—perhaps the stress drove him to seek comfort in drink. Regrettable, but I don't see how this concerns Judith's death."
    },
    {
      "condition": "Edgar's personal journal",
      "secret": "That's absurd! Edgar harboring romantic feelings toward his own cousin? I cannot believe Margarett would have allowed such improper thoughts to persist. Judith was engaged to Arthur Cavendish—a union I arranged myself. Edgar knew this perfectly well. If what you say is true, it reveals a disturbing lack of moral character in my nephew. However, infatuation is not evidence of murder, Detective."
    },
    {
      "condition": "Laboratory equipment",
      "secret": "Edgar recently completed his medical studies. It's not surprising that he possesses some equipment to continue his education and research. He mentioned wanting to establish a small practice in the village. I encouraged his diligence—it seemed a suitable profession for a young man without inheritance. His father left him nothing, you see, which is why my sister returned to Blackwood Manor after her husband's death."
    },
    {
      "condition": "Broken mirror",
      "secret": "My sister has always had a volatile temperament. I imagine she was overwhelmed with grief upon learning of Judith's death—we all were. Breaking a mirror in a fit of anger is regrettable but understandable under such circumstances. Margarett and Judith were... not always close, but they were family nonetheless. I'm certain any injury was accidental."
    },
    {
      "condition": "Arthur's father's letter",
      "secret": "I was perfectly aware of the Cavendish family's financial situation when I arranged the marriage. Every noble family has its challenges in these changing times. The letter merely confirms what I already knew—that Arthur's father saw this union as advantageous. That's precisely why my will stipulates that only Judith's children could inherit the property. I am not a fool, Detective. I protected the Blackwood legacy while securing a respectable marriage for my daughter."
    },
    {
      "condition": "Wet handkerchiefs",
      "secret": "The servants were naturally upset by Judith's death. She was well-liked among the staff, perhaps too familiar with them at times. Martha in particular had been with us since Judith's childhood. Her dismissal so shortly before this tragedy was unfortunate timing, but necessary given her betrayal of our trust."
    },
    {
      "condition": "Medical letter",
      "secret": "I was not aware of Martha's personal situation. Servants do not typically share their family affairs with me, nor would I expect them to. If she needed additional funds for a family emergency, she should have asked for an advance on her wages rather than resorting to theft. Her actions left Lady Blackwood no choice but to dismiss her."
    },
    {
      "condition": "Locket with photo",
      "secret": "What is this? My daughter and the stable hand? This is... this is scandalous! Victor Langley was employed to care for the horses, not to form inappropriate attachments with the daughter of the house! This explains his insolent manner these past few months. I had attributed it to poor upbringing, but it seems the situation was far worse than I imagined. This man must be questioned immediately! If he took advantage of my daughter's innocent nature, he will answer for it!"
    },
    {
      "condition": "Small shrub",
      "secret": "I believe this plant was part of my late father's collection of medicinal herbs. The cellar hasn't been properly organized for years—many items remain from previous generations. I have little knowledge of plants or their properties. Perhaps Edgar would know more, given his medical training. Or you could ask the gardener if he uses such things for pest control. I certainly had no reason to handle such materials myself."
    },
    {
      "condition": "Jewelry box",
      "secret": "*examines with authority* What are you doing with my wife's jewelry? You're not authorized to walk around with them, go put them back immediately. ▬ *annoyed* These marks are unacceptable! Have them cleaned by... *catches himself* Actually, just put them back in their place."
    }
  ]
}
