{
  "secrets": [
    {
      "condition": "Burnt journal page",
      "secret": "*looks at the page with studied calm* I don't know what this is, or who wrote it. 'M' could refer to anyone. Martha, perhaps? That servant my sister-in-law had to dismiss? *disdainful tone* These scribbles have no value for your investigation, I'm certain. You should focus your efforts on more substantial leads, Detective."
    },
    {
      "condition": "Dismissal letter",
      "secret": "Ah, Martha's dismissal. It was about time. *smiles slightly* That woman took improper liberties with Judith. I informed Lady Blackwood that I had caught this servant rummaging through her jewelry. *folds hands* A house like Blackwood Manor demands impeccable servants. I believe my sister-in-law made the decision that was necessary."
    },
    {
      "condition": "Scented tea box",
      "secret": "*takes the box confidently* This is my personal tea, indeed. I have it specially imported from London. *sniffs delicately* A subtle aroma, isn't it? Lady Blackwood prefers more ordinary blends. *sets down the box* I don't see how my tea preferences concern your investigation. Judith never touched it, if that's your question."
    },
    {
      "condition": "Lord Blackwood's will",
      "secret": "My brother's testamentary provisions? *raises an eyebrow* I wasn't aware of the precise details. *reads quickly* Ah, I see he protected himself against the Cavendish family's ambitions. A wise precaution. *forced smile* My brother has always been... cautious in business matters. I suppose this makes Judith's death all the more tragic for him. Without her, no heirs... *deliberately stops* What a sad situation."
    },
    {
      "condition": "Hidden message",
      "secret": "*examines coldly* Judith's handwriting, no doubt. 'Important news'? *slightly sarcastic tone* My niece had a tendency to dramatize trivialities. *calculated pause* It was probably some insignificant detail regarding her wedding. Or perhaps one of her little rebellions against her father's authority. She had a penchant for the theatrical, you know."
    },
    {
      "condition": "Ring with initials",
      "secret": "Arthur Cavendish's signet ring. *rolls eyes* What was it doing in the stable? I couldn't say. *adjusts her shawl* Perhaps Arthur was inspecting the horses? Or perhaps... *smiles enigmatically* Perhaps he had reasons to be there that are not as innocent as he claims. After all, an engaged man should keep a vigilant eye on his future wife."
    },
    {
      "condition": "Signs of struggle",
      "secret": "An altercation in the stables? *false surprise* I wasn't aware of it. *ostentatiously ponders* Arthur is a gentleman, but all men have their temperament. Perhaps he had to call a servant to order? *insinuating* That stable hand, Victor, I believe? He has always had an... inappropriate attitude. My brother is too lenient with the staff."
    },
    {
      "condition": "Muddy boot prints",
      "secret": "*looks with disdain* I hardly venture into the stables, Detective. It's a... rustic place. *dismissive gesture* Boot prints? Isn't that precisely what one would expect in such a place? The staff comes and goes constantly. I doubt this constitutes evidence of any value."
    },
    {
      "condition": "Small firearm",
      "secret": "*slight surprise* Lady Blackwood owned a weapon? How... unusual. *composes herself* My sister-in-law has always been of an anxious nature. No doubt she was seeking reassurance during my brother's absences. *condescending tone* These fragile women sometimes imagine dangers where there are none. Or perhaps... *significant pause* she had real reasons to fear something?"
    },
    {
      "condition": "Message signed V",
      "secret": "*narrows eyes* 'V'... Victor, I presume? *controlled indignation* This is downright scandalous. A stable hand who dares to address such messages to the daughter of the house! *cutting voice* I have long suspected that this boy was forgetting his place. My brother should have dismissed him years ago. *categorical* You may have your culprit right there, Detective."
    },
    {
      "condition": "Basin",
      "secret": "*observes with affected indifference* Judith had been unwell lately. Morning discomfort, mainly. *detached tone* Lady Blackwood was concerned, but I assured her it was probably just a passing ailment. *penetrating gaze* Why, Detective? Do you think her illness was related to her death?"
    },
    {
      "condition": "Scented tea cup",
      "secret": "*slight tension, quickly mastered* A teacup? I don't see how that... *examines the fingerprint* This mark seems distinctive to you? *shrugs* I couldn't identify the owner of such a print. *waves away the smell* As for this scent, it's probably some blend that Lady Blackwood had prepared for Judith. My sister-in-law has always been very... attentive to her daughter."
    },
    {
      "condition": "Fresh muddy boot prints",
      "secret": "*manifest indignation* Muddy boots in my niece's room? That's revolting! *accusatory tone* Only a servant would have left such traces. Or perhaps... *insinuating* that stable hand we were talking about? If he had the audacity to arrange a meeting with her, who knows how far he might have gone? *turns to the detective* Have you questioned this Victor? His presence in Judith's room on the night of her death would be more than incriminating, wouldn't it?"
    },
    {
      "condition": "Empty alcohol bottles",
      "secret": "*visible irritation* My son sometimes relaxes with a drink, like any gentleman. *defensive tone* His medical studies have been grueling. *regains composure* Edgar is brilliant, you know. Recently graduated with honors. These bottles are just a... temporary outlet. *direct gaze* I see absolutely no connection to Judith's death."
    },
    {
      "condition": "Edgar's personal journal",
      "secret": "*momentary shock, then forced laughter* That's absurd! Edgar, in love with Judith? *disdainful* These are just adolescent ramblings, nothing more. They grew up together, like brother and sister. *colder voice* I find it particularly inappropriate that you have read my son's private writings. These juvenile fantasies have no relevance to your investigation, Detective. None."
    },
    {
      "condition": "Laboratory equipment",
      "secret": "*smiles with pride* My son continues his medical research, even here. *superior tone* Edgar has always been passionate about science. This equipment allows him to deepen his knowledge of pharmacology. *shrugs* After all, a doctor must stay at the forefront of his field. *pointed look* My son is destined for a brilliant future, Detective. Unlike certain members of this household."
    },
    {
      "condition": "Broken mirror",
      "secret": "*unconsciously touches her hand* A simple accident. *annoyed* I made a sudden gesture upon learning of Judith's death. The mirror fell, I cut myself picking up the pieces. *dry tone* Contrary to appearances, Detective, I loved my niece. Her death... affected me. *looks away* We had our differences, but she remained of my blood."
    },
    {
      "condition": "Arthur's father's letter",
      "secret": "*smiles coldly* The Cavendishes are not as subtle as they think. *reads the letter with a smirk* My brother was perfectly aware of their intentions. That's precisely why he had his will drawn up in this manner. *contemptuous tone* High society is nothing but a chess game, Detective. Some play better than others. My brother has always been a strategist... unfortunately for the Cavendishes."
    },
    {
      "condition": "Wet handkerchiefs",
      "secret": "*impatient* Wet handkerchiefs? Really, Detective? *exasperated sigh* Martha was probably crying about her dismissal. Servants are so... emotional. *condescending tone* She had become attached to Judith, I suppose. Too attached, in my opinion. This kind of familiarity is not healthy between masters and servants. *categorical* Her dismissal was justified, regardless of the tears shed."
    },
    {
      "condition": "Medical letter",
      "secret": "*affects indifference* The personal problems of servants do not concern me. *falsely compassionate* It's unfortunate for her brother, of course, but that doesn't justify theft. *firm tone* If she needed money, she could have approached my brother openly. Theft remains theft, whatever the motivation. *smiles coldly* Morality is not negotiable according to circumstances, Detective."
    },
    {
      "condition": "Locket with photo",
      "secret": "*visibly shocked, then disgusted* So it's true. Judith and this... this stable hand. *puts down the locket as if it were soiled* What degradation! My brother's daughter, the heiress of Blackwood, lowering herself to a liaison with a servant. *furious* This is precisely the kind of behavior that destroys families like ours. *composes herself* My poor brother... he would die of shame if he knew."
    },
    {
      "condition": "Small shrub",
      "secret": "*barely perceptible tension* This plant? *feigns ignorance* I believe it's a remnant of my father's collections. He was interested in botany. *detached tone* I don't know its precise properties. *vague gesture* Edgar might be able to inform you, with his medical knowledge. *looks at her watch* Is this really relevant, Detective? An old plant in a dusty cellar... I doubt it has any connection to our current tragedy."
    },
    {
      "condition": "Jewelry box",
      "secret": "*examines the box with studied calm* These jewels belong to my sister-in-law, of course. *absentmindedly touches the ring* A lovely collection, though somewhat outdated to my taste. *detached tone* I don't see how Lady Blackwood's ornaments concern your investigation, Detective. ▬ *assured tone* That dirt? It must be soot. Martha probably handled them with her dirty hands when she stole them."
    }
  ]
}
